//
//  PrivacyView.swift
//  DAYCE
//
//  Created by ひろ on 2022/10/29.
//

import SwiftUI

struct PrivacyView: View {
    
    var body: some View {
        ScrollView {
            Text(
            """
            プライバシーポリシー
            Hiro(以下、「当方」といいます。)は、DAYCEアプリを[オープンソース/無料/フリーミアム/広告サポート/商用]アプリとして構築しました。このサービスは、当方によって無料で提供され、そのまま使用することを目的としています。
            このページは、誰かがサービスを利用することを決定した場合、個人情報の収集、使用、および開示に関するポリシーについて訪問者に通知するために使用されます。
            サービスを使用することを選択した場合、お客様は、このポリシーに関連する情報の収集と使用に同意するものとします。当方が収集する個人情報は、サービスの提供および改善に使用されます。当方は、本プライバシーポリシーに記載されている場合を除き、お客様の情報を誰とも使用または共有しません。
            このプライバシーポリシーで使用される用語は、本プライバシーポリシーで別段の定めがない限り、DAYCEでアクセスできる利用規約と同じ意味を持ちます。
            情報の収集と使用
            より良い経験のために、当社のサービスを使用している間、当方は、特定の個人を特定できる情報を当社に提供する必要がある場合があります。当方が要求する情報は、[お客様のデバイスに保持され、当方によっていかなる方法でも収集されません]/[当社によって保持され、このプライバシーポリシーに記載されているように使用されます]。
            このアプリは、お客様を識別するために使用される情報を収集する可能性のあるサードパーティのサービスを使用します。
            アプリが使用するサードパーティのサービスプロバイダーのプライバシーポリシーへのリンク
            Google Playサービス
            アドモブ
            ログデータ
            私/当社は、お客様がサービスを使用するたびに、アプリにエラーが発生した場合、私/当社が携帯電話でログデータと呼ばれるデータと情報を収集することをお知らせします。このログデータには、デバイスのインターネットプロトコル(「IP」)アドレス、デバイス名、オペレーティングシステムのバージョン、my/当社のサービスを利用する際のアプリの設定、本サービスの使用日時、その他の統計などの情報が含まれる場合があります。
            クッキー
            クッキーは、匿名の一意の識別子として一般的に使用される少量のデータを含むファイルです。これらは、訪問したWebサイトからブラウザに送信され、デバイスの内部メモリに保存されます。
            本サービスでは、これらの「クッキー」を明示的に使用しません。ただし、アプリは、情報を収集し、サービスを改善するために「クッキー」を使用するサードパーティのコードやライブラリを使用する場合があります。これらのクッキーを承認または拒否し、クッキーがいつデバイスに送信されるかを知ることができます。クッキーを拒否することを選択した場合、本サービスの一部を使用できない場合があります。
            サービスプロバイダ
            I/当社は、以下の理由により、第三者企業および個人を雇用することがあります。
            当社のサービスを促進するため。
            当社に代わってサービスを提供するため。
            サービス関連サービスを実行するため、または
            当社のサービスがどのように使用されているかを分析するのに役立ちます。
            これらの第三者が個人情報にアクセスできることを本サービスのユーザーに通知したいと考えています。その理由は、私たちに代わって割り当てられたタスクを実行するためです。ただし、他の目的で情報を開示または使用しない義務があります。
            セキュリティ
            私/私たちはあなたの個人情報を提供することに対するあなたの信頼を大切にし、それを保護する商業的に受け入れられる手段を使用するよう努めています。しかし、インターネットを介した送信方法や電子ストレージの方法は100%安全で信頼性が高く、I/Weは絶対的なセキュリティを保証することはできません。
            他のサイトへのリンク
            本サービスには、他のサイトへのリンクが含まれている場合があります。サードパーティのリンクをクリックすると、そのサイトに移動します。これらの外部サイトは私/私たちによって運営されていないことに注意してください。したがって、これらのウェブサイトのプライバシーポリシーを確認することを強くお勧めします。私/私たちは、第三者のサイトまたはサービスのコンテンツ、プライバシーポリシー、または慣行を管理しておらず、責任を負いません。
            子どものプライバシー
            これらのサービスは、13歳未満の人には対処しません。私/私たちは、13歳未満の子供から故意に個人を特定できる情報を収集することはありません。I/Weが13歳未満の子供が私/私たちに個人情報を提供したことが判明した場合、私/私たちは直ちにサーバーから削除します。お客様が親または保護者であり、お子様が個人情報を当社に提供したことを認識している場合は、私/当社に連絡して、必要な措置を講じるようお願いいたします。
            このプライバシーポリシーの変更
            I/当社は、プライバシーポリシーを随時更新することがあります。したがって、変更については、このページを定期的に確認することをお勧めします。I/当社は、このページに新しいプライバシーポリシーを掲載することにより、変更を通知します。
            このポリシーは2022年10月29日から有効です。
            このプライバシーポリシーページは、privacypolicytemplate.netで作成され、アプリのプライバシーポリシージェネレーターによって変更/生成されました。
"""
            ).padding()
        }
    }
}

struct PrivacyView_Previews: PreviewProvider {
    static var previews: some View {
        PrivacyView()
    }
}
